Modules/Core/Traits/BelongsToCompany.php

select `companies`.*, `company_user`.`user_id` as `pivot_user_id`, `company_user`.`company_id` as `pivot_company_id` from `companies` inner join `company_user` on `companies`.`id` = `company_user`.`company_id` where `company_user`.`user_id` = 32 limit 1
---
    protected static function getCurrentCompanyId(): ?int
    {
        $user = Auth::user();
        if ( ! $user) {
            return null;
        }

        // Get current company ID from session
        if (session()->has('current_company_id')) {
            return session('current_company_id');
        }

        // If not in session, fallback to the first company in the user's many-to-many relation
        $company = $user->companies()->first();