Modules/Core/Traits/BelongsToCompany.php

        }
        // 3. Fallback to first company for user
        else {
            $company = $user->companies()->first();
---
select `companies`.*, `company_user`.`user_id` as `pivot_user_id`, `company_user`.`company_id` as `pivot_company_id` from `companies` inner join `company_user` on `companies`.`id` = `company_user`.`company_id` where `company_user`.`user_id` = 32 limit 1