app/Http/Middleware/ConfigureTenant.php

select * from `companies` where `search_code` = 'PXG7F' limit 1
---
    public function handle(Request $request, Closure $next): Response
    {
        $user = Auth::user();

        if ( ! $user) {
            return $next($request);
        }

        // Get the current tenant from the route or query string
        $company = $request->route('tenant');

        // If company is a search_code, find the company
        if (is_string($company)) {
            $company = Company::where('search_code', $company)->first();