app/Http/Middleware/EnsureUserCanAccessCompany.php

    public function handle(Request $request, Closure $next): Response
    {
        $user = Auth::user();

        // If no user is authenticated, allow the request to continue
        if ( ! $user) {
            return $next($request);
        }

        // Get company from route or query string
        $company = $request->route('tenant');

        // If company is a search_code, find the company
        if (is_string($company)) {
            $company = Company::where('search_code', $company)->first();
---
select * from `companies` where `search_code` = 'PXG7F' limit 1