app/Http/Middleware/SetTenantFromQueryString.php

    public function handle(Request $request, Closure $next): Response
    {
        $user    = Auth::user();
        $company = Company::query()->where('search_code', Str::upper(request('tenant')))->first();
---
select * from `companies` where `search_code` = 'IVPLV2' limit 1