Modules/Expenses/Filament/Company/Resources/Expenses/Schemas/ExpenseForm.php

                            ->columnSpan(1),
                    ]),

                Section::make(trans('ip.expense_items'))
                    ->schema([
                        Repeater::make('expenseItems')
                            ->defaultItems(0)
                            ->relationship('expenseItems')
                            ->label(trans('ip.expense_items'))
                            ->reorderable()
                            ->addActionLabel(trans('ip.add_new_row'))
                            ->columns(6) // Adjust columns to control field widths
                            ->schema([
                                Select::make('item_id')
                                    ->label(trans('ip.item'))
                                    ->options(Product::pluck('product_name', 'id')->toArray())
                                    ->searchable()
                                    ->preload()
                                    ->required(),
                                TextInput::make('quantity')->numeric()->required(),
                                TextInput::make('price')->numeric()->required(),
                                TextInput::make('discount')->numeric()->default(0),
                                TextInput::make('subtotal')->numeric()->default(0)->disabled(),
                            ])
                            ->collapsed(false)
                            /*->afterStateHydrated(function ($component, $state) {
                                // overwrite any stray default state with what the request provided
                                if (is_array($state) && $state !== []) {
                                    // Normalize to numeric keys so Livewire/Filament don’t try to merge by UUID
                                    $component->rawState(array_values($state));
                                }
                            })*/
                            ->afterStateUpdated(fn ($set, $get) => (new ExpenseCalculator())->updateGrandTotal($set, $get, 'expenseItems', 'subtotal', 'expense_item_subtotal')),
                    ])
                    ->columnSpanFull(),
---
select `product_name`, `id` from `products` where `products`.`company_id` = 22 and `products`.`company_id` in (22)