Modules/Expenses/Services/ExpenseService.php

insert into `expenses` (`expense_number`, `expense_amount`, `expensed_at`, `category_id`, `customer_id`, `expense_type`, `expense_status`, `company_id`) values ('EXP-387347834', 200, '2025-05-05 00:00:00', '3', '62', 'one_time', 'pending', 22)
---
    public function createExpense(array $data): Expense
    {
        DB::beginTransaction();

        try {
            $expense = Expense::create([
                'expense_number' => $data['expense_number'],
                'expense_amount' => $data['expense_amount'],
                'expensed_at'    => isset($data['expensed_at']) ? Carbon::parse($data['expensed_at']) : now(),
                'category_id'    => $data['category_id'],
                'customer_id'    => $data['customer_id'],
                'expense_type'   => $data['expense_type'],
                'expense_status' => $data['expense_status'],
            ]);